areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
    // write register configuration
    regptr16 = (volatile uint16_t*) &MDC; // Get target address
    *regptr16 = (pwm_config.MDC.value & REG_MDC_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_MDC_VALID_DATA_READ_MASK) == (pwm_config.MDC.value & REG_MDC_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &MPER; // Get target address
    *regptr16 = (pwm_config.MPER.value & REG_MPER_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_MPER_VALID_DATA_READ_MASK) == (pwm_config.MPER.value & REG_MPER_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &LFSR; // Get target address
    *regptr16 = (pwm_config.LFSR.value & REG_LFSR_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LFSR_VALID_DATA_READ_MASK) == (pwm_config.LFSR.value & REG_LFSR_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&CMBTRIGL); // Get target address
    *regptr32 = (pwm_config.CMBTRIG.value & REG_CMBTRIG_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_CMBTRIG_VALID_DATA_READ_MASK) == (pwm_config.CMBTRIG.value & REG_CMBTRIG_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONA; // Get target address
    *regptr16 = (pwm_config.LOGCONA.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONA.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONB; // Get target address
    *regptr16 = (pwm_config.LOGCONB.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONB.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONC; // Get target address
    *regptr16 = (pwm_config.LOGCONC.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONC.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCOND; // Get target address
    *regptr16 = (pwm_config.LOGCOND.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCOND.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONE; // Get target address
    *regptr16 = (pwm_config.LOGCONE.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONE.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &LOGCONF; // Get target address
    *regptr16 = (pwm_config.LOGCONF.value & REG_LOGCONy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_LOGCONy_VALID_DATA_READ_MASK) == (pwm_config.LOGCONF.value & REG_LOGCONy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter
    
    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTA; // Get target address
    *regptr16 = (pwm_config.PWMEVTA.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTA.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTB; // Get target address
    *regptr16 = (pwm_config.PWMEVTB.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTB.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTC; // Get target address
    *regptr16 = (pwm_config.PWMEVTC.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTC.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTD; // Get target address
    *regptr16 = (pwm_config.PWMEVTD.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTD.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTE; // Get target address
    *regptr16 = (pwm_config.PWMEVTE.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTE.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    // write register configuration
    regptr16 = (volatile uint16_t*) &PWMEVTF; // Get target address
    *regptr16 = (pwm_config.PWMEVTF.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK); // write value with bit-mask
    fres &= ((*regptr16 & REG_PWMEVTy_VALID_DATA_READ_MASK) == (pwm_config.PWMEVTF.value & REG_PWMEVTy_VALID_DATA_WRITE_MASK)); // Test if written value matches parameter

    return(fres);
}

/*!hspwm_init_pwm_generator
 * ************************************************************************************************
 * Summary:
 * Writes a complete PWM generator register set configuration
 *
 * Parameters:
 *	HSPWM_C_MODULE_CONFIG_t pg_config
 * 
 * Description:
 * Each PWM generator of the high resolution PWM module of the dsPICs have an identical set of
 * configuration and status registers. These registers are merged into the data structure 
 * HSPWM_C_GENERATOR_CONFIG_t. This data structure can be used to set/load a default configuration 
 * in user code. This routine can be used to write this complete PWM generator register configuration 
 * at once while still every write process is monitored and checked.
 * ***********************************************************************************************/
volatile uint16_t hspwm_init_pwm_generator ( uint16_t instance, HSPWM_C_GENERATOR_CONFIG_t pg_config ) {

    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint32_t *regptr32;
    volatile uint16_t reg_offset;

    // determine register offset
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL); 

    // write PWM generator instance register configuration
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1CONL + reg_offset); // capture register address
    *regptr32 = (pg_config.PGxCON.value & REG_PGxCON_VALID_DATA_WRITE_MASK); // write value to registers
    fres &= ((*regptr32 & REG_PGxCON_VALID_DATA_READ_MASK) == (pg_config.PGxCON.value & REG_PGxCON_VALID_DATA_WRITE_MASK)); // read and compare register values
    
    // write PWM generator instance register configuration
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1STAT + reg_offset); // capture register address
    *regptr16 = (pg_config.PGxSTAT.value & REG_PGxSTAT_VALID_DATA_WRITE_MASK); // write value to registers
    fres &= ((*regptr32 & REG_PGxSTAT_VALID_DATA_READ_MASK) == (pg_config.PGxSTAT.value & REG_PGxSTAT_VALID_DATA_WRITE_MASK)); // read and compare register values

    // write PWM generator instance register configuration
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset); // capture register address
    *regptr32 = (pg_config.PGxIOCON.value & REG_PGxIOCON_VALID_DATA_WRITE_MASK); // write value to registers
    fres &= ((*regptr32 & REG_PGxIOCON_VALID_DATA_READ_MASK) == (pg_config.PGxSTAT.value & REG_PGxIOCON_VALID_DATA_WRITE_MASK)); // read and compare register values

    // write PWM generator instance register configuration
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1EVTL + reg_offset); // capture register address
    *regptr32 = (pg_config.PGxEVT.value & REG_PGxEVTy_VALID_DATA_WRITE_MASK); // write value to registers
    fres &= ((*regptr32 & REG_PGxEVTy_VALID_DATA_READ_MASK) == (pg_config.PGxEVT.value & REG_PGxEVTy_VALID_DATA_WRITE_MASK)); // read and compare register values

    // write PWM generator instance register configuration
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1FPCIL + reg_offset); // capture register address
    *regptr32 = (pg_config.PGxFPCI.value & REG_PGxyPCI_VALID_DATA_WRITE_MASK); // write value to registers
    fres &= ((*regptr32 & REG_PGxyPCI_VALID_DATA_READ_MASK) == (pg_config.PGxFPCI.value & REG_PGxyPCI_VALID_DATA_WRITE_MASK)); // read and compare register values

    return(fres);
}


