areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
/*!hspwm_init_independent_pwm
 * ************************************************************************************************
 * Summary:
 * Sets the basic configuration of a PWM generator 
 *
 * Parameters:
 *	(none)
 * 
 * Description:
 * This PWM instance configuration includes PWMxH/PWMxL outputs, selection of clock source and dividers,
 * dead times and events. Each instance configuration disables the instance by default. the PWM instance 
 * needs to be enabled by using the function call "hspwm_enable_pwm(instance)".
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_init_independent_pwm(
            uint16_t instance, 
            REGBLK_PCLKCON_t regPCLK, 
            REGBLK_PGxCH_CONFIG_t regPGxCON, 
            REGBLK_PGxEVT_CONFIG_t regPGxEVT,
            REGBLK_PGxIO_CONFIG_t regPGxIOCON, 
            REGBLK_PGxDEAD_TIME_t regPGxDT
    )
{
    
    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint32_t *regptr32;
    volatile uint16_t reg_offset;

    // write clock configuration
    regptr16 = (volatile uint16_t*) &PCLKCON;
    *regptr16 = (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK);

    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PCLKCON_VALID_DATA_READ_MASK) == (regPCLK.value & REG_PCLKCON_VALID_DATA_WRITE_MASK));
    
    // write PWM instance configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1CONL + reg_offset);
    *regptr32 = (regPGxCON.value & REG_PGxCON_VALID_DATA_WRITE_MASK);

    // write PWM instance event configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2EVTL - (volatile uint16_t)&PG1EVTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1EVTL + reg_offset);
    *regptr32 = (regPGxEVT.value & REG_PGxEVTy_VALID_DATA_WRITE_MASK);

    // write IO configuration
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    *regptr32 = (regPGxIOCON.value & REG_PGxIOCON_VALID_DATA_WRITE_MASK);

    // write dead time
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2DTL - (volatile uint16_t)&PG1DTL);
    regptr32 = (volatile uint32_t*) ((volatile uint8_t*)&PG1DTL + reg_offset);
    *regptr32 = (regPGxDT.value & REG_PGxDT_VALID_DATA_WRITE_MASK);
    
    return(fres);

}

/*!hspwm_init_pwm_timing
 * ************************************************************************************************
 * Summary:
 * Sets the basic signal timing configuration of a PWM generator 
 *
 * Parameters:
 *	uint16_t instance:    Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *  uint16_t regPGxPER:   PWM generator period register setting the switching period 
 *  uint16_t regPGxDC:    PWM generator duty cycle register setting the switching signal on-time 
 *  uint16_t regPGxPHASE: PWM generator phase register setting the switching signal phase shift
 * 
 * Description:
 * This function defines the PWM instance switching frequency signal timing, such as frequency/period,
 * duty cycle/on-time and phase shift.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_init_pwm_timing(uint16_t instance, uint16_t regPGxPER, uint16_t regPGxDC, uint16_t regPGxPHASE)
{
    
    volatile uint16_t fres=1;
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;

    // write PWM Period
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2PER - (volatile uint16_t)&PG1PER);
    regptr16 = (volatile uint16_t*)((volatile uint8_t*)&PG1PER + reg_offset);
    *regptr16 = (regPGxPER & REG_PGxPER_VALID_DATA_WRITE_MASK);

    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PGxPER_VALID_DATA_READ_MASK) == (regPGxPER & REG_PGxPER_VALID_DATA_WRITE_MASK));
    
    // write Duty Cycle
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2DC - (volatile uint16_t)&PG1DC);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1DC + reg_offset);
    *regptr16 = regPGxDC;

    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PGxDC_VALID_DATA_READ_MASK) == (regPGxDC & REG_PGxDC_VALID_DATA_WRITE_MASK));
    
    // write Phase Shift
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2PHASE - (volatile uint16_t)&PG1PHASE);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1PHASE + reg_offset);
    *regptr16 = regPGxPHASE;
    
    // Test if written value matches parameter
    fres &= ((*regptr16 & REG_PGxPHASE_VALID_DATA_READ_MASK) == (regPGxPHASE & REG_PGxPHASE_VALID_DATA_WRITE_MASK));

    return(fres);

}

/*!hspwm_set_duty_cycle
 * ************************************************************************************************
 * Summary:
 * Writes a new duty cycle value to the individual duty cycle register of the specified PWM instance 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * Writes a new duty cycle value to the individual duty cycle register of the PWM generator 
 * specified by parameter 'instance'.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_set_duty_cycle(uint16_t instance, uint16_t regPGxDC, uint16_t regPGxDCA)
{
    volatile uint16_t fres=0;
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;

    // write Duty Cycle
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2DC - (volatile uint16_t)&PG1DC);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1DC + reg_offset);
    *regptr16 = regPGxDC;

    // write Duty Cycle Adjustment
    reg_offset = (instance-1) * ((volatile uint16_t)&PG2DCA - (volatile uint16_t)&PG1DCA);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1DCA + reg_offset);
    *regptr16 = regPGxDCA;

    // Test if written value matches parameter
    fres = ((*regptr16 & REG_PGxDCA_VALID_DATA_READ_MASK) == (regPGxDCA & REG_PGxDCA_VALID_DATA_WRITE_MASK));
    
    return(fres);
}

