areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hspwm_c.c
/*!hspwm_enable_pwm
 * ************************************************************************************************
 * Summary:
 * Enables a PWM generator 
 *
 * Parameters:
 *	uint16_t instance:    Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *  bool wait_for_hres:   PWM generator period register setting the switching period 
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 * 
 * Description:
 * This function disables a PWM generator defined by parameter INSTANCE. If high resolution mode is 
 * enabled, this function waits until the high resolution ready bit is set before enabling the PWM
 * generator.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_enable_pwm(uint16_t instance, bool wait_for_hres)
{

    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;
    volatile uint16_t timeout=0;
    
    if(wait_for_hres)
    {
        while((PCLKCONbits.HRRDY == PCLKCON_HRRDY_WAIT) && 
          (PCLKCONbits.HRERR == PCLKCON_HRERR_NO_ERROR) && 
            (timeout++ < 5000))
            {
                Nop();
                Nop();
                Nop();
            }

        if(timeout >= 5000) // if High Resolution Ready Bit has not been set
        { return(0); }      // skip ENABLE and return failure code

    }

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1CONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf | REG_PGCON_ON_PWM_ENABLED;
    
    return((volatile uint16_t)(volatile bool)(*regptr16 & REG_PGCON_ON_PWM_ENABLED));

}

/*!hspwm_disable_pwm
 * ************************************************************************************************
 * Summary:
 * Disables a PWM generator 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function disables a PWM generator defined by parameter INSTANCE.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_disable_pwm(uint16_t instance)
{

    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2CONL - (volatile uint16_t)&PG1CONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1CONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_PGCON_ON_PWM_RESET;
    
    return((volatile uint16_t)(volatile bool)(*regptr16 & REG_PGCON_ON_PWM_ENABLED));
}
/*!hspwm_ovr_hold
 * ************************************************************************************************
 * Summary:
 * Overrides both PWM outputs (H/L) of the specified PWM instance 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function disables both outputs PWMxH and PWMxL of the PWM generator defined by 
 * parameter 'instance'. While in override mode, the PWM module is still running and thus
 * keeps generating triggers for other peripherals (e.g. ADC). Only the PWM outputs PWMxH and PWMxL
 * are forced to a permanent pin state defined by register bits PGxIOCONL->OVRDAT.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_ovr_hold(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf | REG_IOCON_OVREN_COMP_SET;
    
    return((volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_OVREN_COMP_SET));
}

/*!hspwm_ovr_release
 * ************************************************************************************************
 * Summary:
 * Releases both PWM outputs (H/L) of the specified PWM instance 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function enables both outputs PWMxH and PWMxL of the PWM generator defined by 
 * parameter 'instance' by releasing them from override conditions.
 * ***********************************************************************************************/

inline volatile uint16_t hspwm_ovr_release(uint16_t instance)
{
    volatile uint16_t *regptr16;
    volatile uint16_t reg_offset;
    volatile uint16_t reg_buf=0;

    reg_offset = (instance-1) * ((volatile uint16_t)&PG2IOCONL - (volatile uint16_t)&PG1IOCONL);
    regptr16 = (volatile uint16_t*) ((volatile uint8_t*)&PG1IOCONL + reg_offset);
    reg_buf = *regptr16;
    *regptr16 = reg_buf & REG_IOCON_OVREN_COMP_RESET;
    
    return(1 - (volatile uint16_t)(volatile bool)(*regptr16 & REG_IOCON_OVREN_COMP_SET));
}

/*!hspwm_ovr_release_high_side
 * ************************************************************************************************
 * Summary:
 * Releases the high-side PWM output PWMxH of the specified PWM instance 
 *
 * Parameters:
 *	uint16_t instance:  Index of the PWM generator addressed (e.g. 1 for PWM1, 2 for PWM2, etc.)
 *
 * Returns:
 *  uint16_t            a 16-bit unsigned integer number indicating if the write process was 
 *                      executed successfully (0: failure, 1: success)
 *  
 * Description:
 * This function enables the high-side PWM output PWMxH of the PWM generator defined by 
 * parameter 'instance' by releasing them from override conditions.
 * ***********************************************************************************************/

